


// Семафор(організація,черга для потоків) — це механізм синхронізації для управління доступом до спільних ресурсів у багатопоточних програмах.

// 1. Обмеження підключень — контроль кількості активних запитів на сервер (наприклад, до 10).
// 2. Робота з ресурсами — ефективно використовує обмежені ресурси, зберігаючи пам'ять на мінімальному рівні.

// Допомагає уникнути конфліктів між процесами чи потоками, які можуть одночасно намагатися використовувати спільний ресурс.


// DLL (Dynamic Link Library) — це файл, що містить код і дані, які можуть використовувати кілька програм одночасно.
// Якщо DLL знаходиться в папці System32, вона доступна для всіх програм, оскільки ця папка є стандартним місцем для системних бібліотек.
// Якщо DLL знаходиться поза папкою System32, її потрібно помістити в каталог програми або вказати шлях до неї в системному шляху, щоб програма могла її знайти.
// DLL дозволяє програмам ділитися функціями та ресурсами без необхідності включати їх у кожну програму окремо.

